Reports/КСУ_ВедомостьПоЗаймам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Report>
		<Properties>
			<Name>КСУ_ВедомостьПоЗаймам</Name>
		</Properties>
	</Report>
</MetaDataObject>

AccumulationRegisters/ИА_ЗаймыСФондов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ИА_ЗаймыСФондов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаНал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБезнал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписатьДолг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_Фонды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ЦФО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПричинаЗайма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КСУ_ПричиныЗайма</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаФонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_Фонды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ЦФО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КрайнийСрок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсточникОтложенногоДохода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ИсточникиСпецДохода</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КСУ_Займы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/КСУ_ОперацииПоЗаймам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>КСУ_ОперацииПоЗаймам</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПолучениеЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредоставлениеЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратВыданногоЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПолученногоЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеДолгаПоЗаймуВыданному</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеДолгаПоЗаймуПолученному</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/КСУ_ВедомостьПоЗаймам/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура СформироватьНаСервере()
	ИспПодр = Константы.КСУ_ФП_ИспользоватьПодразделения.Получить();

	ТабДок.Очистить();
	
	отч = РеквизитФормыВЗначение("Отчет");
	макет = отч.ПолучитьМакет("Макет");
	
	Обл = макет.ПолучитьОбласть("Шапка");
	обл.параметры.ДатаОтчета = ТекущаяДата();
	обл.параметры.Период = формат(ДатаНачала,"ДФ=dd.MM.yyyy") + " - " + формат(ДатаКонца,"ДФ=dd.MM.yyyy");
	ТабДок.Вывести(обл);
	
	ВыбФонды = Новый массив;
	Для каждого стр из Фонды Цикл
		Если стр.выбрать Тогда
			ВыбФонды.Добавить(стр.фонд);
		КонецЕсли;
	КонецЦикла;
	ВсеФонды = ВыбФонды.Количество() = Фонды.Количество();
	
	ВыбОперации = Новый массив;
	Для каждого стр из ВидыОпераций Цикл
		Если стр.выбрать Тогда
			ВыбОперации.Добавить(стр.ВидОперации);
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКонца", КонецДня(ДатаКонца));
	Запрос.УстановитьПараметр("ДатаКонца1", КонецДня(ДатаКонца) + 1);
	Запрос.УстановитьПараметр("Фонды", ВыбФонды);
	Запрос.УстановитьПараметр("Операции", ВыбОперации);
	
	для каждого стрОрг из Организации Цикл
		если не стрОрг.Выбрать тогда
			Продолжить;
		КонецЕсли;
		
		/////////// ОРГАНИЗАЦИЯ
		Обл = макет.ПолучитьОбласть("ГруппаОрганизация");
		обл.параметры.Организация = стрОрг.Организация;
		ТабДок.Вывести(обл);
		
		Запрос.УстановитьПараметр("Организация", стрОрг.Организация);
		
		//
		Если Настройки[0].Выбрать Тогда // остатки по займам сводно
			ВывестиОстатки(запрос, макет, табдок, ИспПодр, ДатаКонца);
		КонецЕсли;
		
		//
		Если Настройки[1].Выбрать Тогда // Сводные данные
			ВывестиСводныеДанные(запрос, макет, табдок, ИспПодр, ДатаКонца, ДатаНачала);
		КонецЕсли;
		
		//
		Если Настройки[2].Выбрать Тогда // детализация
			ВывестиДетализацию(запрос, макет, табдок, ИспПодр, ДатаКонца, ДатаНачала, Сортировка);
		КонецЕсли;
		
	КонецЦикла; // по организациям
	
	Обл = макет.ПолучитьОбласть("Подвал");
	ТабДок.Вывести(обл);
	
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДок.АвтоМасштаб = Истина;
	
	Элементы.ТабДок.РежимМасштабированияПросмотра = РежимМасштабированияПросмотра.Обычный;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВывестиДетализацию(запрос, макет, табдок, ИспПодр, ДатаКонца, ДатаНачала, Сортировка)
	фондОтлДохода = Константы.ИА_ФП_ФондДоходовБП.Получить();
	
	Обл = макет.ПолучитьОбласть("ПустаяСтрока");
	ТабДок.Вывести(обл);
	
	ОстаткиИсх = ПолучитьОстатки(запрос, КонецДня(ДатаКонца)+1);
	ОстаткиИсх.Свернуть("Подразделение,Фонд", "ФондДолжен,ДолжныФонду");
	
	ОстаткиВх = ПолучитьОстатки(запрос, ДатаНачала);
	ОстаткиВх.Свернуть("Подразделение,Фонд", "ФондДолжен,ДолжныФонду");
	
	
	Запрос.текст = "ВЫБРАТЬ
	               |	Подзапрос.Ид_Отл КАК Ид_Отл,
	               |	Подзапрос.ФП КАК ФП,
	               |	Подзапрос.НомерФП КАК НомерФП,
	               |	Подзапрос.Операция КАК Операция,
	               |	Подзапрос.КомментарийПриЗайме КАК КомментарийПриЗайме,
	               |	Подзапрос.КомментарийПриВозврате КАК КомментарийПриВозврате,
	               |	Подзапрос.Период КАК Период,
	               |	Подзапрос.КрайнийСрок КАК КрайнийСрок,
	               |	Подзапрос.Подразделение КАК Подразделение,
	               |	Подзапрос.Фонд КАК Фонд,
	               |	Подзапрос.ПодразделениеКонтрагент КАК ПодразделениеКонтрагент,
	               |	Подзапрос.ФондКонтрагент КАК ФондКонтрагент,
	               |	Подзапрос.ПолучениеЗайма КАК ПолучениеЗайма,
	               |	-Подзапрос.ПредоставлениеЗайма КАК ПредоставлениеЗайма
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ИА_ЗаймыОб.ИсточникОтложенногоДохода.НаименованиеИД КАК Ид_Отл,
	               |		ИА_ЗаймыОб.Регистратор КАК ФП,
	               |		ИА_ЗаймыОб.Регистратор.Номер КАК НомерФП,
	               |		ИА_ЗаймыОб.Период КАК Период,
	               |		ИА_ЗаймыОб.КрайнийСрок КАК КрайнийСрок,
	               |		ВЫБОР
	               |			КОГДА ИА_ЗаймыОб.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	               |				ТОГДА ЗНАЧЕНИЕ(перечисление.КСУ_ОперацииПоЗаймам.ПредоставлениеЗайма)
	               |			ИНАЧЕ ВЫБОР
	               |					КОГДА ИА_ЗаймыОб.СписатьДолг
	               |						ТОГДА ЗНАЧЕНИЕ(перечисление.КСУ_ОперацииПоЗаймам.СписаниеДолгаПоЗаймуВыданному)
	               |					ИНАЧЕ ЗНАЧЕНИЕ(перечисление.КСУ_ОперацииПоЗаймам.ВозвратВыданногоЗайма)
	               |				КОНЕЦ
	               |		КОНЕЦ КАК Операция,
	               |		ИА_ЗаймыОб.ид.Комментарий КАК КомментарийПриЗайме,
	               |		ВЫБОР
	               |			КОГДА ИА_ЗаймыОб.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	               |				ТОГДА """"
	               |			ИНАЧЕ ИА_ЗаймыОб.Комментарий
	               |		КОНЕЦ КАК КомментарийПриВозврате,
	               |		ИА_ЗаймыОб.Подразделение КАК Подразделение,
	               |		ИА_ЗаймыОб.Фонд КАК Фонд,
	               |		ИА_ЗаймыОб.НаПодразделение КАК ПодразделениеКонтрагент,
	               |		ИА_ЗаймыОб.НаФонд КАК ФондКонтрагент,
	               |		0 КАК ПолучениеЗайма,
	               |		ВЫБОР
	               |			КОГДА ИА_ЗаймыОб.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	               |				ТОГДА ИА_ЗаймыОб.СуммаБезнал
	               |			ИНАЧЕ -ИА_ЗаймыОб.СуммаБезнал
	               |		КОНЕЦ КАК ПредоставлениеЗайма
	               |	ИЗ
	               |		РегистрНакопления.ИА_ЗаймыСФондов КАК ИА_ЗаймыОб
	               |	ГДЕ
	               |		ИА_ЗаймыОб.Период МЕЖДУ &ДатаНачала И &ДатаКонца
	               |		И ИА_ЗаймыОб.Организация = &Организация
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ИА_ЗаймыОб.ИсточникОтложенногоДохода.НаименованиеИД,
	               |		ИА_ЗаймыОб.Регистратор,
	               |		ИА_ЗаймыОб.Регистратор.Номер,
	               |		ИА_ЗаймыОб.Период,
	               |		ИА_ЗаймыОб.КрайнийСрок,
	               |		ВЫБОР
	               |			КОГДА ИА_ЗаймыОб.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	               |				ТОГДА ЗНАЧЕНИЕ(перечисление.КСУ_ОперацииПоЗаймам.ПолучениеЗайма)
	               |			ИНАЧЕ ВЫБОР
	               |					КОГДА ИА_ЗаймыОб.СписатьДолг
	               |						ТОГДА ЗНАЧЕНИЕ(перечисление.КСУ_ОперацииПоЗаймам.СписаниеДолгаПоЗаймуПолученному)
	               |					ИНАЧЕ ЗНАЧЕНИЕ(перечисление.КСУ_ОперацииПоЗаймам.ВозвратПолученногоЗайма)
	               |				КОНЕЦ
	               |		КОНЕЦ,
	               |		ИА_ЗаймыОб.ид.Комментарий,
	               |		ВЫБОР
	               |			КОГДА ИА_ЗаймыОб.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	               |				ТОГДА """"
	               |			ИНАЧЕ ИА_ЗаймыОб.Комментарий
	               |		КОНЕЦ,
	               |		ИА_ЗаймыОб.НаПодразделение,
	               |		ИА_ЗаймыОб.НаФонд,
	               |		ИА_ЗаймыОб.Подразделение,
	               |		ИА_ЗаймыОб.Фонд,
	               |		ВЫБОР
	               |			КОГДА ИА_ЗаймыОб.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	               |				ТОГДА ИА_ЗаймыОб.СуммаБезнал
	               |			ИНАЧЕ -ИА_ЗаймыОб.СуммаБезнал
	               |		КОНЕЦ,
	               |		0
	               |	ИЗ
	               |		РегистрНакопления.ИА_ЗаймыСФондов КАК ИА_ЗаймыОб
	               |	ГДЕ
	               |		ИА_ЗаймыОб.Период МЕЖДУ &ДатаНачала И &ДатаКонца
	               |		И ИА_ЗаймыОб.Организация = &Организация) КАК Подзапрос
	               |ГДЕ
	               |	Подзапрос.Фонд В(&Фонды)
	               |	И Подзапрос.Операция В(&Операции)";
	
	тз = запрос.Выполнить().Выгрузить();
	
	Если тз.Количество() = 0 ТОгда
		Обл = макет.ПолучитьОбласть("ДетализацияНетДвижений");
		ТабДок.Вывести(обл);
		возврат;
	КонецЕсли;

	Обл = макет.ПолучитьОбласть("ДетализацияШапка");
	ТабДок.Вывести(обл);
	
	тз_подр = тз.Скопировать();
	тз_подр.Свернуть("Подразделение");
	
	Для каждого стрПодр из тз_подр цикл
		Если ИспПодр тогда
			Обл = макет.ПолучитьОбласть("Подразделение");
			Обл.Параметры.Подразделение = стрПодр.Подразделение;
			ТабДок.Вывести(обл);
		КонецЕсли;
		
		ДанныеПоФондам = тз.Скопировать();
		Сч = ДанныеПоФондам.Количество() - 1;
		Пока сч >=0 Цикл
			если ДанныеПоФондам[сч].Подразделение <> стрПодр.Подразделение Тогда
				ДанныеПоФондам.Удалить(сч);
			КонецЕсли;				
			сч = сч - 1;
		КонецЦикла;
		
		ДанныеПоФондам.Свернуть("Фонд");
		
		Для каждого стрФонд из ДанныеПоФондам цикл
			
			Обл = макет.ПолучитьОбласть("ДетализацияШапкаФонд");
			Обл.Параметры.Фонд = стрФонд.Фонд;
			Обл.Параметры.Заголовок = ?(стрФонд.Фонд = фондОтлДохода, "Идентификатор операции отложенного дохода", "Операции с получением займов");
			Обл.Параметры.ФондКонтрагент = ?(ИспПодр, "Подразделение / Фонд-контрагент", "Фонд-контрагент");
			ТабДок.Вывести(обл);
			
			ДанныеПоФонду = тз.Скопировать();
			Сч = ДанныеПоФонду.Количество() - 1;
			Пока сч >=0 Цикл
				если ДанныеПоФонду[сч].Подразделение <> стрПодр.Подразделение или ДанныеПоФонду[сч].фонд <> стрФонд.фонд Тогда
					ДанныеПоФонду.Удалить(сч);
				КонецЕсли;				
				сч = сч - 1;
			КонецЦикла;
			
			Если Сортировка = 0 Тогда
				ДанныеПоФонду.Сортировать("Период");
			ИначеЕсли Сортировка = 1 Тогда
				ДанныеПоФонду.Сортировать("Операция");
			ИначеЕсли Сортировка = 2 Тогда
				ДанныеПоФонду.Сортировать("ФондКонтрагент");
			КонецЕсли;
			
			// входящий
			Нстр = ОстаткиВх.НайтиСтроки(Новый Структура("Подразделение,фонд", стрПодр.Подразделение, стрФонд.фонд));
			Обл = макет.ПолучитьОбласть("ДетализацияВходящийОстаток");
			Если Нстр.количество() > 0 Тогда
				ЗаполнитьЗначенияСвойств(Обл.Параметры, Нстр[0]);
				Обл.Параметры.ДолжныФонду =  -Нстр[0].ДолжныФонду;
			КонецЕсли;
			Обл.Параметры.Период = ДатаНачала;
			ТабДок.Вывести(обл);
			
			Для каждого детСтр из ДанныеПоФонду Цикл				
				Обл = макет.ПолучитьОбласть("ДетализацияСтрока");
				ЗаполнитьЗначенияСвойств(Обл.Параметры, детСтр);
				Если ИспПодр тогда
					Обл.Параметры.ФондКонтрагент = строка(детСтр.ПодразделениеКонтрагент) + " / "  + детСтр.ФондКонтрагент;
				КонецЕсли;
				Если детСтр.Фонд = фондОтлДохода Тогда
					Обл.Параметры.ПолучениеЗайма = детСтр.Ид_Отл;
				КонецЕсли;
				ТабДок.Вывести(обл);
			КонецЦикла;
			
			// исходящий
			Нстр = ОстаткиИсх.НайтиСтроки(Новый Структура("Подразделение,фонд", стрПодр.Подразделение, стрФонд.фонд));
			Обл = макет.ПолучитьОбласть("ДетализацияИсходящийОстаток");
			Если Нстр.количество() > 0 Тогда
				ЗаполнитьЗначенияСвойств(Обл.Параметры, Нстр[0]);				
				Обл.Параметры.ДолжныФонду =  -Нстр[0].ДолжныФонду;
			КонецЕсли;
			Обл.Параметры.Период = ДатаКонца;
			Обл.Параметры.СтрокаФондДолжен = ?(детСтр.Фонд = фондОтлДохода, "", "Фонд должен");
			ТабДок.Вывести(обл);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВывестиСводныеДанные(запрос, макет, табдок, ИспПодр, ДатаКонца, ДатаНачала)
	
	фондОтлДохода = Константы.ИА_ФП_ФондДоходовБП.Получить();
	
	Обл = макет.ПолучитьОбласть("ПустаяСтрока");
	ТабДок.Вывести(обл);
	
	Остатки = ПолучитьОстатки(запрос, КонецДня(ДатаКонца)+1);
	
	Если Остатки.Количество() = 0 ТОгда
		Обл = макет.ПолучитьОбласть("СводныеНетДвижений");
		обл.параметры.ДатаКонца = формат(ДатаКонца, "ДФ=dd.MM.yyyy");
		ТабДок.Вывести(обл);
		возврат;
	КонецЕсли;
	
	Обл = макет.ПолучитьОбласть("СводныеШапка");
	обл.параметры.ДатаКонца = формат(ДатаКонца, "ДФ=dd.MM.yyyy");
	ТабДок.Вывести(обл);
	
	тз_подр = Остатки.Скопировать();
	тз_подр.Свернуть("Подразделение");
	
	Для каждого стрПодр из тз_подр цикл
		Если ИспПодр тогда
			Обл = макет.ПолучитьОбласть("Подразделение");
			Обл.Параметры.Подразделение = стрПодр.Подразделение;
			ТабДок.Вывести(обл);
		КонецЕсли;
		
		ДанныеПоФондам = Остатки.Скопировать();
		Сч = ДанныеПоФондам.Количество() - 1;
		Пока сч >=0 Цикл
			если ДанныеПоФондам[сч].Подразделение <> стрПодр.Подразделение Тогда
				ДанныеПоФондам.Удалить(сч);
			КонецЕсли;				
			сч = сч - 1;
		КонецЦикла;
		
		ДанныеПоФондам.Свернуть("Фонд");
		
		Для каждого стрФонд из ДанныеПоФондам цикл
			
			Обл = макет.ПолучитьОбласть("СводныеШапкаФонд"+?(ИспПодр, "_Подр", ""));
			Обл.Параметры.Фонд = стрФонд.Фонд;
			Обл.Параметры.ФондДолжен = ?(стрФонд.Фонд = фондОтлДохода, "", "Фонд должен фонду-контрагенту");
			ТабДок.Вывести(обл);
			
			ДанныеПоФонду = Остатки.Скопировать();
			Сч = ДанныеПоФонду.Количество() - 1;
			Пока сч >=0 Цикл
				если ДанныеПоФонду[сч].Подразделение <> стрПодр.Подразделение или ДанныеПоФонду[сч].фонд <> стрФонд.фонд Тогда
					ДанныеПоФонду.Удалить(сч);
				КонецЕсли;				
				сч = сч - 1;
			КонецЦикла;
			
			
			Для каждого детСтр из ДанныеПоФонду Цикл				
				Обл = макет.ПолучитьОбласть("СводныеСтрока"+?(ИспПодр, "_Подр", ""));
				ЗаполнитьЗначенияСвойств(Обл.Параметры, детСтр);
				ТабДок.Вывести(обл);
			КонецЦикла;
			
			// Итого
			Обл = макет.ПолучитьОбласть("СводныеИтого");
			Обл.Параметры.ФондДолжен = ДанныеПоФонду.Итог("ФондДолжен");
			Обл.Параметры.ДолжныФонду = ДанныеПоФонду.Итог("ДолжныФонду");
			ТабДок.Вывести(обл);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВывестиОстатки(запрос, макет, табдок, ИспПодр, ДатаКонца)
	
	Обл = макет.ПолучитьОбласть("ПустаяСтрока");
	ТабДок.Вывести(обл);

	тз_остатки = ПолучитьОстатки(запрос, КонецДня(ДатаКонца)+1);
	тз_остатки.Свернуть("Подразделение,Фонд", "ФондДолжен,ДолжныФонду");
	
	Если тз_остатки.Количество() = 0 ТОгда
		Обл = макет.ПолучитьОбласть("ОстаткиНетДвижений");
		обл.параметры.ДатаКонца = формат(ДатаКонца, "ДФ=dd.MM.yyyy");
		ТабДок.Вывести(обл);
		возврат;
	КонецЕсли;
	
	Обл = макет.ПолучитьОбласть("ОстаткиШапка"+?(ИспПодр, "_Подр", ""));
	обл.параметры.ДатаКонца = формат(ДатаКонца, "ДФ=dd.MM.yyyy");
	ТабДок.Вывести(обл);
	
	Для каждого стр из тз_остатки Цикл
		Обл = макет.ПолучитьОбласть("ОстаткиСстрока"+?(ИспПодр, "_Подр", ""));
		ЗаполнитьЗначенияСвойств(обл.параметры, стр);
		ТабДок.Вывести(обл);
	КонецЦикла;
	
	Обл = макет.ПолучитьОбласть("ОстаткиИтого");
	обл.параметры.ФондДолжен = тз_остатки.Итог("ФондДолжен");
	обл.параметры.ДолжныФонду = тз_остатки.Итог("ДолжныФонду");
	ТабДок.Вывести(обл);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОстатки(запрос, НаДату)
	Запрос.текст = "ВЫБРАТЬ
	               |	Подзапрос.Подразделение КАК Подразделение,
	               |	Подзапрос.Фонд КАК Фонд,
	               |	Подзапрос.ПодразделениеКонтрагент КАК ПодразделениеКонтрагент,
	               |	Подзапрос.ФондКонтрагент КАК ФондКонтрагент,
	               |	СУММА(Подзапрос.ФондДолжен) КАК ФондДолжен,
	               |	СУММА(Подзапрос.ДолжныФонду) КАК ДолжныФонду
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ИА_ЗаймыСФондовОстатки.Подразделение КАК Подразделение,
	               |		ИА_ЗаймыСФондовОстатки.Фонд КАК Фонд,
	               |		ИА_ЗаймыСФондовОстатки.НаПодразделение КАК ПодразделениеКонтрагент,
	               |		ИА_ЗаймыСФондовОстатки.НаФонд КАК ФондКонтрагент,
	               |		0 КАК ФондДолжен,
	               |		ИА_ЗаймыСФондовОстатки.СуммаБезналОстаток КАК ДолжныФонду
	               |	ИЗ
	               |		РегистрНакопления.ИА_ЗаймыСФондов.Остатки(&НаДату, Организация = &Организация) КАК ИА_ЗаймыСФондовОстатки
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ИА_ЗаймыСФондовОстатки.НаПодразделение,
	               |		ИА_ЗаймыСФондовОстатки.НаФонд,
	               |		ИА_ЗаймыСФондовОстатки.Подразделение,
	               |		ИА_ЗаймыСФондовОстатки.Фонд,
	               |		ИА_ЗаймыСФондовОстатки.СуммаБезналОстаток,
	               |		0
	               |	ИЗ
	               |		РегистрНакопления.ИА_ЗаймыСФондов.Остатки(&НаДату, Организация = &Организация) КАК ИА_ЗаймыСФондовОстатки) КАК Подзапрос
	               |ГДЕ
	               |	Подзапрос.Фонд В(&Фонды)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Подзапрос.Подразделение,
	               |	Подзапрос.Фонд,
	               |	Подзапрос.ПодразделениеКонтрагент,
	               |	Подзапрос.ФондКонтрагент";
	Запрос.УстановитьПараметр("НаДату", НаДату);
	Возврат запрос.Выполнить().Выгрузить();
КонецФункции



&НаКлиенте
Процедура Сформировать(Команда)

	если ДатаНачала = Дата(1,1,1) или ДатаКонца = Дата(1,1,1) ТОгда
		ПоказатьПредупреждение(,"Заполните период отчета!");
		Возврат;
	КонецЕсли;
	
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьНастройки();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройки()
	НовстрН = Настройки.Добавить();
	НовстрН.Настройка = "Остатки по займам на конец периода";
	НовстрН.Выбрать = истина;
	
	НовстрН = Настройки.Добавить();
	НовстрН.Настройка = "Сводные данные  (включает сводные по обычным фондам и таблицу по отложенному доходу)";
	НовстрН.Выбрать = ложь;
	
	НовстрН = Настройки.Добавить();
	НовстрН.Настройка = "Детализация";
	НовстрН.Выбрать = ложь;
	
	//
	МассОрг = ИА_ФПСервер.ПолучитьОрганизацииДляОтчетов();
	Для каждого орг из МассОрг Цикл
		НовстрН = Организации.Добавить();
		НовстрН.Организация = орг;
		НовстрН.Выбрать = истина;
	КонецЦикла;
	Если не Константы.ИА_ФП_ВестиФППоОрганизациям.Получить() Тогда
		НовстрН = Организации.Добавить();
		НовстрН.Организация = Справочники.Организации.ПустаяСсылка();
		НовстрН.Выбрать = истина;
	КонецЕсли;
	
	//
	ЭтоРСФ = ИА_ФП.ЭтоРСФ();
	Выборка= Справочники.ИА_Фонды.Выбрать(,,,"Наименование");
	Пока выборка.Следующий() Цикл
		Если не выборка.ПометкаУдаления Тогда
			//Если ЭтоРСФ или выборка.Счет <> Справочники.ИА_Счета.Счет1 Тогда
				НовстрН = Фонды.Добавить();
				НовстрН.Фонд = Выборка.Ссылка;
				НовстрН.Выбрать = истина;
			//КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	//
	для каждого во из Перечисления.КСУ_ОперацииПоЗаймам Цикл		
		НовстрН = ВидыОпераций.Добавить();
		НовстрН.ВидОперации = во;
		НовстрН.Выбрать = истина;		
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ПоказатьСкрытьФильтры(Команда)
	Элементы.ГруппаПравая.Видимость = не Элементы.ГруппаПравая.Видимость;
	Элементы.ПоказатьСкрытьФильтры.Заголовок = ?(Элементы.ГруппаПравая.Видимость, "Скрыть фильтры", "Показать фильтры")
КонецПроцедуры


&НаКлиенте
Процедура НастройкиВыбратьПриИзменении(Элемент)
	Элементы.ГруппаНастройки.ЦветТекстаЗаголовка = новый цвет(90, 150, 249);
	для каждого стр из Настройки Цикл
		если стр.выбрать = ложь тогда
			Элементы.ГруппаНастройки.ЦветТекстаЗаголовка = новый цвет(255, 0, 0);	
			Элементы.СброситьФильтры.Видимость = истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура Настройки1ВыбратьПриИзменении(Элемент)
	Элементы.ГруппаОрганизации.ЦветТекстаЗаголовка = новый цвет(90, 150, 249);
	для каждого стр из Организации Цикл
		если стр.выбрать = ложь тогда
			Элементы.ГруппаОрганизации.ЦветТекстаЗаголовка = новый цвет(255, 0, 0);	
			Элементы.СброситьФильтры.Видимость = истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ФондыВыбратьПриИзменении(Элемент)
	Элементы.ГруппаФонды.ЦветТекстаЗаголовка = новый цвет(90, 150, 249);
	для каждого стр из Фонды Цикл
		если стр.выбрать = ложь тогда
			Элементы.ГруппаФонды.ЦветТекстаЗаголовка = новый цвет(255, 0, 0);
			Элементы.СброситьФильтры.Видимость = истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ВидыОперацийВыбратьПриИзменении(Элемент)
	Элементы.ГруппаВидыОпераций.ЦветТекстаЗаголовка = новый цвет(90, 150, 249);
	для каждого стр из ВидыОпераций Цикл
		если стр.выбрать = ложь тогда
			Элементы.ГруппаВидыОпераций.ЦветТекстаЗаголовка = новый цвет(255, 0, 0);
			Элементы.СброситьФильтры.Видимость = истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ВыбратьВсеНастройки(Команда)
	Элементы.ГруппаНастройки.ЦветТекстаЗаголовка = новый цвет(90, 150, 249);
	для каждого стр из Настройки Цикл
		стр.выбрать = истина;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура СнятьВыборСоВсехНастроек(Команда)
	Элементы.ГруппаНастройки.ЦветТекстаЗаголовка = новый цвет(255, 0, 0);
	для каждого стр из Настройки Цикл
		стр.выбрать = ложь;
	КонецЦикла;
	
	Элементы.СброситьФильтры.Видимость = истина;
КонецПроцедуры


&НаКлиенте
Процедура ВыбратьВсеОрганизации(Команда)
	Элементы.ГруппаОрганизации.ЦветТекстаЗаголовка = новый цвет(90, 150, 249);
	для каждого стр из Организации Цикл
		стр.выбрать = истина;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура СнятьВыборСоВсехОрганизаций(Команда)
	Элементы.ГруппаОрганизации.ЦветТекстаЗаголовка = новый цвет(255, 0, 0);
	для каждого стр из Организации Цикл
		стр.выбрать = ложь;
	КонецЦикла;

	Элементы.СброситьФильтры.Видимость = истина;
КонецПроцедуры


&НаКлиенте
Процедура ВыбратьВсеФонды(Команда)
	Элементы.ГруппаФонды.ЦветТекстаЗаголовка = новый цвет(90, 150, 249);
	для каждого стр из Фонды Цикл
		стр.выбрать = истина;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура СнятьВыборСоВсехФондов(Команда)
	Элементы.ГруппаФонды.ЦветТекстаЗаголовка = новый цвет(255, 0, 0);
	для каждого стр из Фонды Цикл
		стр.выбрать = ложь;
	КонецЦикла;
	
	Элементы.СброситьФильтры.Видимость = истина;
КонецПроцедуры


&НаКлиенте
Процедура ВыбратьВсеОперации(Команда)
	Элементы.ГруппаВидыОпераций.ЦветТекстаЗаголовка = новый цвет(90, 150, 249);
	для каждого стр из ВидыОпераций Цикл
		стр.выбрать = истина;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура СнятьВыбоСоВсехОпераций(Команда)
	Элементы.ГруппаВидыОпераций.ЦветТекстаЗаголовка = новый цвет(255, 0, 0);
	для каждого стр из ВидыОпераций Цикл
		стр.выбрать = ложь;
	КонецЦикла;
	
	Элементы.СброситьФильтры.Видимость = истина;
КонецПроцедуры


&НаКлиенте
Процедура СброситьФильтры(Команда)
	ВыбратьВсеНастройки(Неопределено);
	ВыбратьВсеОрганизации(Неопределено);
	ВыбратьВсеФонды(Неопределено);
	ВыбратьВсеОперации(Неопределено);
	
	Элементы.СброситьФильтры.Видимость = ложь;
КонецПроцедуры


&НаКлиенте
Процедура ЗакрытьВсеГруппы(Команда)
	Элементы.ГруппаОрганизации.Скрыть();
	Элементы.ГруппаФонды.Скрыть();
	Элементы.ГруппаНастройки.Скрыть();
	Элементы.ГруппаВидыОпераций.Скрыть();
	Элементы.ГруппаСортировка.Скрыть();
КонецПроцедуры


&НаКлиенте
Процедура РазвернутьВсеГруппы(Команда)
	Элементы.ГруппаОрганизации.Показать();
	Элементы.ГруппаФонды.Показать();
	Элементы.ГруппаНастройки.Показать();
	Элементы.ГруппаВидыОпераций.Показать();
	Элементы.ГруппаСортировка.Показать();
КонецПроцедуры


&НаКлиенте
Процедура pdf(Команда)
	Оповещение  = Новый ОписаниеОповещения("ПутьКФайлуНачалоВыбораЗавершение", ЭтаФорма);
    ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение); 
	ДиалогВыбора.ПолноеИмяФайла = "Ведомость по займам "+ формат(ДатаНачала, "ДФ=dd.MM.yyyy") +"-" + формат(ДатаКонца, "ДФ=dd.MM.yyyy");
	ДиалогВыбора.Расширение = "pdf";
    ДиалогВыбора.Показать(Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбораЗавершение(МассивФайлов, ДопПараметры) Экспорт
    Если МассивФайлов = Неопределено Тогда
        Возврат;
	КонецЕсли;
	
	ТабДок.Записать(МассивФайлов[0], ТипФайлаТабличногоДокумента.PDF);
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДатаКонца = ТекущаяДата();
	ДатаНачала = ДатаКонца - 60*60*24 * 7;
КонецПроцедуры
